In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_pickle("db_clean.pkl")

In [3]:
df.head()

  Survived Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0        0      3    male  22.0      1      0   7.2500        S
1        1      1  female  38.0      1      0  71.2833        C
2        1      3  female  26.0      0      0   7.9250        S
3        1      1  female  35.0      1      0  53.1000        S
4        0      3    male  35.0      0      0   8.0500        S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    category
 1   Pclass    891 non-null    category
 2   Sex       891 non-null    category
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    category
dtypes: category(4), float64(2), int64(2)
memory usage: 31.9 KB

In [5]:
df["Sex"].unique()

['male', 'female']
Categories (2, object): ['male', 'female']

In [6]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
le_sex.fit(df["Sex"])
le_sex.classes_

array(['female', 'male'], dtype=object)

In [7]:
df["Sex"] = le_sex.transform(df["Sex"])

In [8]:
df.head()

  Survived Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0        0      3    1  22.0      1      0   7.2500        S
1        1      1    0  38.0      1      0  71.2833        C
2        1      3    0  26.0      0      0   7.9250        S
3        1      1    0  35.0      1      0  53.1000        S
4        0      3    1  35.0      0      0   8.0500        S

In [10]:
emb = pd.get_dummies(df["Embarked"],prefix_sep = "_",prefix = "Emb")

In [11]:
emb.head()

   Emb_C  Emb_Q  Emb_S
0      0      0      1
1      1      0      0
2      0      0      1
3      0      0      1
4      0      0      1

In [12]:
df = pd.concat([df,emb],axis = 1)

In [13]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Emb_C,Emb_Q,Emb_S
0,0,3,1,22.0,1,0,7.2500,S,0,0,1
1,1,1,0,38.0,1,0,71.2833,C,1,0,0
2,1,3,0,26.0,0,0,7.9250,S,0,0,1
3,1,1,0,35.0,1,0,53.1000,S,0,0,1
4,0,3,1,35.0,0,0,8.0500,S,0,0,1

In [14]:
df.drop("Embarked",axis=1,inplace = True)
df.head()

  Survived Pclass  Sex   Age  SibSp  Parch     Fare  Emb_C  Emb_Q  Emb_S
0        0      3    1  22.0      1      0   7.2500      0      0      1
1        1      1    0  38.0      1      0  71.2833      1      0      0
2        1      3    0  26.0      0      0   7.9250      0      0      1
3        1      1    0  35.0      1      0  53.1000      0      0      1
4        0      3    1  35.0      0      0   8.0500      0      0      1

In [15]:
df = pd.get_dummies(df,columns=["Pclass"],drop_first=True)
df.head()

,Survived,Sex,Age,SibSp,Parch,Fare,Emb_C,Emb_Q,Emb_S,Pclass_2,Pclass_3
0,0,1,22.0,1,0,7.2500,0,0,1,0,1
1,1,0,38.0,1,0,71.2833,1,0,0,0,0
2,1,0,26.0,0,0,7.9250,0,0,1,0,1
3,1,0,35.0,1,0,53.1000,0,0,1,0,0
4,0,1,35.0,0,0,8.0500,0,0,1,0,1

In [16]:
df.to_pickle("titanic_clean_final.pkl")

In [17]:
df.head()

,Survived,Sex,Age,SibSp,Parch,Fare,Emb_C,Emb_Q,Emb_S,Pclass_2,Pclass_3
0,0,1,22.0,1,0,7.2500,0,0,1,0,1
1,1,0,38.0,1,0,71.2833,1,0,0,0,0
2,1,0,26.0,0,0,7.9250,0,0,1,0,1
3,1,0,35.0,1,0,53.1000,0,0,1,0,0
4,0,1,35.0,0,0,8.0500,0,0,1,0,1

In [23]:
df.isna().sum()

Survived      0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Emb_C         0
Emb_Q         0
Emb_S         0
Pclass_2      0
Pclass_3      0
dtype: int64

In [24]:
mean_value = df["Age"].mean()

In [25]:
df['Age'].fillna(value=mean_value, inplace=True)

In [26]:
df.isna().sum()

Survived    0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Emb_C       0
Emb_Q       0
Emb_S       0
Pclass_2    0
Pclass_3    0
dtype: int64

In [27]:
X = df.drop("Survived",axis= 1)
y = df["Survived"]
X.shape,y.shape

((891, 10), (891,))

In [28]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3,random_state = 42)

In [29]:
X_train.shape,X_test.shape

((623, 10), (268, 10))

In [30]:
from sklearn.linear_model import LogisticRegression
LR = LogisticRegression(solver = "liblinear")
LR.fit(X_train,y_train)

LogisticRegression(solver='liblinear')

In [31]:
LR.score(X_test,y_test)

0.8022388059701493

In [32]:
y_pred = LR.predict(X_test)
y_pred[:20]

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
      dtype=int64)

In [33]:
res = pd.DataFrame(y_test)
res["Predicted"] = y_pred
res.head(10)

    Survived  Predicted
709        1          0
439        0          0
840        0          0
720        1          1
39         1          1
290        1          1
300        1          1
333        0          0
208        1          1
136        1          1

In [35]:
from sklearn.metrics import classification_report,confusion_matrix, accuracy_score
confusion_matrix(y_test,y_pred)

array([[137,  20],
       [ 33,  78]], dtype=int64)

In [36]:
accuracy_score(y_test, y_pred)

0.8022388059701493

In [37]:
from sklearn.neighbors import KNeighborsClassifier

In [38]:
knn = KNeighborsClassifier(n_neighbors=51)

In [39]:
knn.fit(X_train,y_train)

KNeighborsClassifier(n_neighbors=51)

In [42]:
pred = knn.predict(X_test)

In [43]:
accuracy_score(y_test,pred)

0.6567164179104478

In [44]:
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree